//// [tests/cases/compiler/0.0.1_中文测试集/0002_测试.ts] ////

//// [index.d.ts]
//@@{ 库内接口:ku, 属性1:P1, 属性2:P2, 名称:Name, 内容:Text, 选项:ops }
导出 接口 库内接口 {
    属性1: 文字
    属性2: { 名称: 文字, 内容: 任意 }
}
导出 种类 库内类 实现 库内接口{
    属性1: 文字
    属性2: { 名称: 文字, 内容: 任意 }
    构造(选项:库内接口)
}
//// [测试_1.ts]
导入 { 库内接口, 库内类 } 来自 "kuCh"

变量 试验_1: 库内接口 = {
    属性1: "我是属性1,也是P1",
    属性2: { 名称: "我是属性2,也是P2", 内容: "我是任意内容" }
}

变量 属性1 = "我是试验 2"
变量 Text = "我是变量内容"
变量 Name = "我是属性2,也是P2"

变量 P2 = { Name, Text }

变量 试验_2 = { 属性1, P2 }

变量 试验_3 = 新建 库内类(试验_1)
试验_3

变量 试验_4 = 新建 库内类(试验_2)
试验_4

//// [测试_1.js]
"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
var kuCh_1 = require("kuCh");
var 试验_1 = {
    属性1: "我是属性1,也是P1",
    属性2: { 名称: "我是属性2,也是P2", 内容: "我是任意内容" }
};
var 属性1 = "我是试验 2";
var Text = "我是变量内容";
var Name = "我是属性2,也是P2";
var P2 = { Name: Name, Text: Text };
var 试验_2 = { 属性1: 属性1, P2: P2 };
var 试验_3 = new kuCh_1.库内类(试验_1);
试验_3;
var 试验_4 = new kuCh_1.库内类(试验_2);
试验_4;
